/* The following strings are used, to display the time in a "fuzzy" style.                            */
/* If you want to have other strings, change the second entry in a line. Don't change the first!      */
/* The entry %@ represents the position where the hour is placed.                                     */
/* After every string you have to set a reference whether the referenced hour is the current or the   */
/* next.                                                                                              */

"shortly after %@" 		= "tar éis %@";
"shortly after ref" 	= "current";

"five past %@" 			= "cúig tar éis %@";
"five past ref" 		= "current";

"ten past %@" 			= "deich tar éis %@";
"ten past ref" 			= "current";

"quarter past %@" 		= "ceathrú tar éis %@";
"quarter past ref" 		= "current";

"twenty past %@" 		= "fiche tar éis %@";
"twenty past ref" 		= "current";

"twentyfive past %@" 	= "fiche chúig tar éis %@";
"twentyfive past ref" 	= "current";

"half past %@" 			= "leathuair tar éis %@";
"half past ref" 		= "current";

"twentyfive to %@" 		= "fiche chúig chun %@";
"twentyfive to ref" 	= "next";

"twenty to %@" 			= "fiche chun %@";
"twenty to ref" 		= "next";

"quarter to %@" 		= "ceathrú chun %@";
"quarter to ref" 		= "next";

"ten to %@" 			= "deich chun %@";
"ten to ref" 			= "next";

"five to %@" 			= "cúig chun %@";
"five to ref" 			= "next";

"nearly %@" 			= "beagnach %@";
"nearly ref" 			= "next";


/* hour names */

"twelve" = "a dó dhéag";
"one" = "a haon";
"two" = "a dó";
"three" = "a trí";
"four" = "a ceathair";
"five" = "a cúig";
"six" = "a sé";
"seven" = "a seacht";
"eight" = "a hocht";
"nine" = "a naoi";
"ten" = "a deich";
"eleven" = "a haon déag";


/* special strings */

"%@ o'clock" = "%@ a chlog";
"noon" = "meán lae";
"midnight" = "meán oíche";


/* Menu items */

"About FuzzyClock" = "About FuzzyClock...";
"FuzzyClock Help" = "FuzzyClock Help";
"Preferences ..." = "Preferences...";
"Quit" = "Quit";


/* Others */

"language" = "Language";
"change only FuzzyTime" = "change only FuzzyTime";

"Save" = "Save";

"Fuzzy Preferences" = "Fuzzy Preferences";

"Language Settings" = "Language Settings";
"Specials" = "Specials";
"Special time settings" = "Special time settings";
"Starttime" = "Starttime";
"Endtime" = "Endtime";
"String" = "String";
"time format: hh:mm" = "time format: hh:mm";
"Remove" = "Remove";
"Add" = "Add";

"Color & Font" = "Colour & Font";
"Text color" = "Text colour";
"draw font with shadow" = "draw font with shadow";
"(takes effect when you restart FuzzyClock)" = "(takes effect when you restart FuzzyClock)";
"font name" = "font name";

"show day in menu bar" = "show Japanese day character";
"chime on full hour" = "chime on full hour";

"place clock to the right of Apple's extras" = "place clock to the right of Apple's extras";
"Display & Sound" = "Display & Sound";


/* Weekday abbreviations */

"Sunday" = "dé Domhnaigh";
"Monday" = "dé Luain";
"Tuesday" = "dé Máirt";
"Wednesday" = "dé Céadaoin";
"Thursday" = "dé Déardaoin";
"Friday" = "dé hAoine";
"Saturday" = "dé Sathairn";


/* END OF FILE --- vim:set filetype=c nolist noexpandtab tabstop=4: */
